# 1. Напишите функцию, которая принимает на вход строку - абсолютный путь до файла.
# Функция возвращает кортеж из трёх элементов: путь, имя файла, расширение файла.
#
# 2. Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины:
# имена str, ставка int, премия str с указанием процентов вида “10.25%”.
# В результате получаем словарь с именем в качестве ключа и суммой премии в качестве значения.
# Сумма рассчитывается как ставка умноженная на процент премии
#
# 3. Создайте функцию генератор чисел Фибоначчи

from print_func import print_abs_path_separator, print_dict_gen, print_fibonachi_gen


print_abs_path_separator()

print_dict_gen()

print_fibonachi_gen()